package edu.training.les04.main;

public class Task6 {

	public static void main(String[] args) {
		// 6. Написать программу, которая выводит на экран первые четыре степени числа
		// π.
		System.out.println("Первые четыре степени числа π:");
		System.out.println(Math.pow(Math.PI, 0));
		System.out.println(Math.pow(Math.PI, 1));
		System.out.println(Math.pow(Math.PI, 2));
		System.out.println(Math.pow(Math.PI, 3));

	}

}